"""

7. Реализовать проект «Операции с комплексными числами».
Создайте класс «Комплексное число».
Реализуйте перегрузку методов сложения и умножения комплексных чисел.
Проверьте работу проекта. Для этого создаёте экземпляры класса (комплексные числа), выполните сложение и умножение созданных экземпляров. Проверьте корректность полученного результата.

"""


class ComplexNumber:
    def __init__(self, a, b):
        self.a = a
        self.b = b

    def __add__(self, other):
        return f"Сумма равна: {self.a + other.a} + {self.b + other.b} * i"

    def __mul__(self, other):
        return f"Произведение равно: {self.a * other.a - (self.b * other.b)} + {self.b * other.a} * i"


c_1 = ComplexNumber(5, 4)
c_2 = ComplexNumber(8, 13)
print(c_1 + c_2)
print(c_1 * c_2)
