"""
Задание 1

Поработайте с переменными, создайте несколько, выведите на экран.
Запросите у пользователя некоторые числа и строки и сохраните в переменные,
затем выведите на экран.

"""
a = 10
print(a)
b = a + 8
print(b)
c = "Hello, world!"
print(c)
student_name = input("Введите имя студента: ")
print(student_name)
stud_gr_numb = int(input("Введите номер группы студента: "))
name_courses = input("Введите название курса: ")
print(f"Номер группы студента: {stud_gr_numb}, "
      f"название курса: {name_courses}")
