"""

1. Создать класс TrafficLight (светофор).
определить у него один атрибут color (цвет) и метод running (запуск);
атрибут реализовать как приватный;
в рамках метода реализовать переключение светофора в режимы: красный, жёлтый, зелёный;
продолжительность первого состояния (красный) составляет 7 секунд, второго (жёлтый) — 2 секунды, третьего (зелёный) — на ваше усмотрение;
переключение между режимами должно осуществляться только в указанном порядке (красный, жёлтый, зелёный);
проверить работу примера, создав экземпляр и вызвав описанный метод.

"""

from time import sleep


class TrafficLight:
    __color = ["Красный", "Желтый", "Зеленый"]

    @staticmethod
    def runnig():
        i = 0
        while i < 3:
            print(f"Цвет светофора: {TrafficLight.__color[i]}")
            if i == 0:
                sleep(7)
            if i == 1:
                sleep(2)
            if i == 2:
                sleep(8)
            i += 1


obj = TrafficLight()
obj.runnig()
